//task 1

// — Пароль і 4 спроби. Завдання виконуємо через while або do while.
// 1. Запросити у користувача пароль!
// 2. Якщо пароль не вірний повідомити що залишилось 4 спроби!
// - якщо далі невірні паролі спроби зменшуються.
// - коли спроб вже нема вивести повідомлення: "Будь ласка спробуйте пізніше!".
// 3. Якщо користувач одразу чи після кількох спроб ввів вірний пароль, вивести повідомлення "Запрошуємо на сайт!".
// 4. Завдання реалізуємо без break і міток!

let i = 4;
let ask = prompt('Пароль');
let pass = '1';
do {
  if(ask !== pass){
  	if (i === 1) {
  		alert("Будь ласка спробуйте пізніше!");
  		i = 0;
  	} else {
  		ask = prompt(`Попробуйте ще раз. У вас ще є ${i - 1} спроби`);
    	i--;
  	}
  }
  else if(ask == pass){
    alert('Запрошуємо на сайт!');
    i = 0;
  }
} while(i > 0);


//task 2.1
//  Створіть програму, яка обчислює факторіал натурального числа n, 
//  яке користувач введе з клавіатури.

let n = prompt("Введіть натуральне число");
let result = 1;
let count = 1;
while (count <= n) {
    result = result * count;
    count++;
}
document.write(`<h3> ${result} </h3>`)
document.write(`<h2>Кінець циклу</h2>`);

//task 2.2
// Створіть програму, що виводить на екран 
// всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

let k = 1000;
while ( k <= 9999) {
    k += 3
    document.write(`<h3> ${k} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.3
// Створіть програму, що виводить на екран перші 55 елементів 
// послідовності 1 3 5 7 9 11 13 15 17…

let b = 1;
let c = 1;
while (c <= 55) {
    c ++ 
    b = 2*c-1;
    document.write(`<h3> ${b} </h3>`)
    document.write(`<h3> ${'Кількість ітерацій:' +c} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.4
// Створіть програму, що виводить на екран всі невід'ємні елементи 
// послідовності 90 85 80 75 70 65 60 …

let m = 90; 
while (m >= 0 ) {
    m -= 5;
    document.write(`<h3> ${m} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.5
// Створіть програму, що виводить на екран перші 20 елементів 
// послідовності 2 4 8 16 32 64 128 …

let d = 1;
let p= 1;
while ( p <= 20) {
    p ++;
    total = d*=2;
    document.write(`<h3> ${total} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.6
// Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), 
// де початкове значення a = 2 та які менше 10000

let a=2;
while (a < 10000) {
    document.write(`<h3> ${a} </h3>`)
     a = 2*a-1;
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.7
// Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), 
// де початкове значення змінної a = -166.

let q = -166;
while ( q < 100) {
    if (q > -100 && (q < -9 || q > 9))
    document.write(`<h3> ${q} </h3>`)
    q = 2 * q + 200;
}
document.write(`<h2>Кінець циклу</h2>`);

//task 2.8
// Написати програму що обчислює піднесення до степеня. 
// В 1й промпт вводиться число,а в 2й промпт степінь. 
// Умови: Степінь може бути додатня, від'ємна або 0. 
// Обрахувати всі можливі варіанти циклом for. 
// Задачу бажано виконати використовуючи 1 цикл! 
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;

let y = prompt('Введіть число')
let x = prompt('Введіть степінь')
let u = 1;
let r = x;
if(c<0){
    r=-x;
    u=1/u;
}
let w=0;
while( w<r ) {
    w++;
    u=u*y;
}
document.write(`<h3> ${'Відповідь:' +u} </h3>`);
document.write(`<h2>Кінець циклу</h2>`);

