//task 1
//  Створіть програму, яка обчислює факторіал натурального числа n, 
//  яке користувач введе з клавіатури.

let n = prompt("Введіть натуральне число");
let total = 1;
for(i = n; i > 1; i--){
total*= i;
}
document.write(`<h3> ${total} </h3>`)
document.write(`<h2>Кінець циклу</h2>`);

//task 2
// Створіть програму, що виводить на екран 
// всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

for (let i = 1000; i <= 9999; i += 3) {
    document.write(`<h3> ${i} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 3
// Створіть програму, що виводить на екран перші 55 елементів 
// послідовності 1 3 5 7 9 11 13 15 17…

let b = 1;
for (let i = 1;i <= 55; i ++ ) {
    b = 2*i-1;
        document.write(`<h3> ${b} </h3>`)
        document.write(`<h3> ${'Кількість ітерацій:' +i} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 4
// Створіть програму, що виводить на екран всі невід'ємні елементи 
// послідовності 90 85 80 75 70 65 60 …

for (let i = 90; i >= 0; i -= 5) {
    document.write(`<h3> ${i} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 5
// Створіть програму, що виводить на екран перші 20 елементів 
// послідовності 2 4 8 16 32 64 128 …

let a = 1;
for (let i= 1; i <= 20; i ++) {
    total = a*=2;
    document.write(`<h3> ${total} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 6
// Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), 
// де початкове значення a = 2 та які менше 10000

for (let a= 2; a <= 10000; a = 2*a-1) {
    document.write(`<h3> ${a} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 7
// Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), 
// де початкове значення змінної a = -166.

for (let a = -166; a < 100; a = 2 * a + 200) {
    if (a > -100 && (a < -9 || a > 9))
      document.write(`<h3> ${a} </h3>`)
}
document.write(`<h2>Кінець циклу</h2>`);

//task 8
// Написати програму що обчислює піднесення до степеня. 
// В 1й промпт вводиться число,а в 2й промпт степінь. 
// Умови: Степінь може бути додатня, від'ємна або 0. 
// Обрахувати всі можливі варіанти циклом for. 
// Задачу бажано виконати використовуючи 1 цикл! 
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;

let d = prompt('Введіть число')
let c = prompt('Введіть степінь')
let k = 1;
let m = c;
if(c<0){
    m=-c;
    k=1/k;
}
for(let i=0; i<m; i++) {
    k=k*d;
}
document.write(`<h3> ${'Відповідь:' +k} </h3>`);
document.write(`<h2>Кінець циклу</h2>`);